# Advanced Querying Mongo

Importing libraries and setting up connection

In [1]:
# from pymongo import MongoClient
# client = MongoClient("")
%pip install pymongo

Requirement already satisfied: pymongo in c:\users\daarr\anaconda3\lib\site-packages (4.5.0)
Requirement already satisfied: dnspython<3.0.0,>=1.16.0 in c:\users\daarr\anaconda3\lib\site-packages (from pymongo) (2.4.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
from pymongo import MongoClient

In [3]:
cursor=MongoClient()   

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [4]:
str_conn='mongodb://localhost:27017'  

cursor=MongoClient(str_conn)

cursor

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

In [5]:
db=cursor.companies

In [6]:
colec = db.coleccion

In [7]:
res=colec.find().limit(20)

list(res)[0].keys()

dict_keys(['_id', 'name', 'permalink', 'crunchbase_url', 'homepage_url', 'blog_url', 'blog_feed_url', 'twitter_username', 'category_code', 'number_of_employees', 'founded_year', 'founded_month', 'founded_day', 'deadpooled_year', 'tag_list', 'alias_list', 'email_address', 'phone_number', 'description', 'created_at', 'updated_at', 'overview', 'image', 'products', 'relationships', 'competitions', 'providerships', 'total_money_raised', 'funding_rounds', 'investments', 'acquisition', 'acquisitions', 'offices', 'milestones', 'video_embeds', 'screenshots', 'external_links', 'partners'])

### 1. All the companies whose name match 'Babelgum'. Retrieve only their `name` field.

In [8]:
# Your Code
query = {'name':'Babelgum'}
filtro = {'_id':0,'name': 1}
df=pd.DataFrame(colec.find(query, filtro))
df.head()

       name
0  Babelgum

### 2. All the companies that have more than 5000 employees. Limit the search to 20 companies and sort them by **number of employees**.

In [9]:
# Your Code
query = {'number_of_employees': {'$gt': 5000}}
df=pd.DataFrame(colec.find(query, filtro).sort('number_of_employees', -1).limit(20))
df

                                          name
0                                      Siemens
1                                          IBM
2                                       Toyota
3                                       PayPal
4   Nippon Telegraph and Telephone Corporation
5                          Samsung Electronics
6                                    Accenture
7                    Tata Consultancy Services
8                    Flextronics International
9                                      Safeway
10                                        Sony
11                                          LG
12                                        Ford
13                                      Boeing
14               Digital Equipment Corporation
15                                       Nokia
16                         MItsubishi Electric
17                         MItsubishi Electric
18                                     Comcast
19                                 Bertelsmann

### 3. All the companies founded between 2000 and 2005, both years included. Retrieve only the `name` and `founded_year` fields.

In [10]:
# Your Code
query={'founded_year': {'$lte': 2005,'$gte': 2000}}
filtro = {'_id':0,'name': 1,'founded_year':1 }
df=pd.DataFrame(colec.find(query, filtro))
df.head()

        name  founded_year
0   Wetpaint          2005
1       Zoho          2005
2       Digg          2004
3   Facebook          2004
4  Omnidrive          2005

### 4. All the companies that had a Valuation Amount of more than 100.000.000 and have been founded before 2010. Retrieve only the `name` and `ipo` fields.

In [11]:
# Your Code
query={'$and': [{'founded_year': {'$lt': 2010}},
                {'ipo.valuation_amount': {'$gt': 100_000_000}}]}
filtro = {'_id':0,'name': 1,'ipo.valuation_amount':1}
df=pd.DataFrame(colec.find(query, filtro))
df.head()

       name                                   ipo
0  Facebook  {'valuation_amount': 104000000000.0}
1   Twitter   {'valuation_amount': 18100000000.0}
2      Yelp      {'valuation_amount': 1300000000}
3  LinkedIn    {'valuation_amount': 9310000000.0}
4    Amazon  {'valuation_amount': 100000000000.0}

### 5. All the companies that have less than 1000 employees and have been founded before 2005. Order them by the number of employees and limit the search to 10 companies.

In [12]:
# Your Code
query={'$and': [{'number_of_employees': {'$lt': 1000}},
                {'founded_year': {'$lt': 2005}}]}
       
filtro = {'_id':0,'name': 1,'founded_year':1,'number_of_employees':1}
df=pd.DataFrame(colec.find(query, filtro).sort('number_of_employees', -1).limit(10))
df

                              name  number_of_employees  founded_year
0             Infinera Corporation                  974          2000
1  NorthPoint Communications Group                  948          1997
2                     888 Holdings                  931          1997
3               Forrester Research                  903          1983
4                        SonicWALL                  900          1991
5                       Webmetrics                  900          1999
6             Cornerstone OnDemand                  881          1999
7                          Mozilla                  800          1998
8                       Buongiorno                  800          1999
9                             Yelp                  800          2004

### 6. All the companies that don't include the `partners` field.

In [13]:
# Your Code 
'''
query = {'partners':{'$exists' :'false'}}
filtro = {'_id':0,'name': 1}
df=pd.DataFrame(colec.find(query, filtro))
df
'''
query = {'partners':{'$size' :0}}
filtro = {'_id':0,'name': 1}
df=pd.DataFrame(colec.find(query, filtro))
df.head()

        name
0   Wetpaint
1  AdventNet
2       Zoho
3       Digg
4   Facebook

### 7. All the companies that have a null type of value on the `category_code` field.

In [14]:
# Your Code
query = {'category_code': {'$type': 'null'}}
filtro = {'_id':0,'name': 1, 'category_code':1}
df=pd.DataFrame(colec.find(query, filtro))
df.head()

           name category_code
0    Collective          None
1       Snimmer          None
2        KoolIM          None
3  Level9 Media          None
4       VidKing          None

### 8. All the companies that have at least 100 employees but less than 1000. Retrieve only the `name` and `number of employees` fields.

In [15]:
# Your Code
query={'number_of_employees':{'$gte': 100, '$lt': 1000}}
                
filtro = {'_id':0,'name': 1,'number_of_employees':1}
df=pd.DataFrame(colec.find(query, filtro))
df.head()

        name  number_of_employees
0  AdventNet                  600
1    AddThis                  120
2      OpenX                  305
3   LifeLock                  644
4      Jajah                  110

### 9. Order all the companies by their IPO price in a descending order.

In [16]:
# Your Code
query = {'ipo.valuation_amount':{'$ne' :None}}
filtro = {'_id':0,'name': 1,'ipo.valuation_amount':1}
df=pd.DataFrame(colec.find(query,filtro).sort('ipo.valuation_amount', -1))
df.drop_duplicates(subset="ipo", inplace = True)
df.head()

       name                                   ipo
0      GREE  {'valuation_amount': 108960000000.0}
1  Facebook  {'valuation_amount': 104000000000.0}
2    Amazon  {'valuation_amount': 100000000000.0}
3   Twitter   {'valuation_amount': 18100000000.0}
4   Groupon   {'valuation_amount': 12800000000.0}

### 10. Retrieve the 10 companies with more employees, order by the `number of employees`

In [17]:
# Your Code
query = {}
filtro = {'_id':0, 'name': 1, 'number_of_employees':1}
df=pd.DataFrame(colec.find(query,filtro).sort('number_of_employees', -1).limit(10))
df

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. All the companies founded on the second semester of the year. Limit your search to 1000 companies.

In [18]:
# Your Code
query = {'founded_month': {'$gt': 6}}
filtro = {'_id':0, 'name': 1, 'founded_month':1}
df=pd.DataFrame(colec.find(query,filtro).limit(1000))
df.head()

        name  founded_month
0   Wetpaint             10
1       Zoho              9
2       Digg             10
3  Omnidrive             11
4       eBay              9

### 12. All the companies founded before 2000 that have an acquisition amount of more than 10.000.00

In [19]:
# Your Code
query={'$and': [{'founded_year': {'$lt': 2000}},
                {'acquisition.price_amount': {'$gt': 10_000_000}}]}
filtro = {'_id':0, 'name': 1, 'acquisition.price_amount':1}
df=pd.DataFrame(colec.find(query,filtro))
df.head()

         name                   acquisition
0     Postini   {'price_amount': 625000000}
1    SideStep   {'price_amount': 180000000}
2  Recipezaar    {'price_amount': 25000000}
3      PayPal  {'price_amount': 1500000000}
4    Snapfish   {'price_amount': 300000000}

### 13. All the companies that have been acquired after 2010, order by the acquisition amount, and retrieve only their `name` and `acquisition` field.

In [20]:
# Your Code
query={'acquisition.acquired_year': {'$gt': 2010}}
filtro = {'_id':0, 'name': 1, 'acquisition.acquired_year':1,'acquisition.price_amount':1}
df=pd.DataFrame(colec.find(query,filtro).sort('acquisition.price_amount', -1))
df.head()

                     name                                        acquisition
0                T-Mobile  {'price_amount': 39000000000.0, 'acquired_year...
1    Goodrich Corporation  {'price_amount': 18400000000.0, 'acquired_year...
2                     LSI  {'price_amount': 6600000000.0, 'acquired_year'...
3  National Semiconductor  {'price_amount': 6500000000.0, 'acquired_year'...
4                   Ariba  {'price_amount': 4300000000.0, 'acquired_year'...

### 14. Order the companies by their `founded year`, retrieving only their `name` and `founded year`.

In [21]:
# Your Code
#query = {'founded_year':{'$ne' :None}}   Query para no incluir los que no tienen founded_year
query ={}
filtro = {'_id':0, 'name': 1, 'founded_year':1}
df=pd.DataFrame(colec.find(query,filtro).sort('founded_year', -1))
df.head()

        name  founded_year
0      Fixya        2013.0
1      Wamba        2013.0
2  Advaliant        2013.0
3       Fluc        2013.0
4     iBazar        2013.0

### 15. All the companies that have been founded on the first seven days of the month, including the seventh. Sort them by their `acquisition price` in a descending order. Limit the search to 10 documents.

In [22]:
# Your Code
query = {'founded_day': {'$lte': 7}}
filtro = {'_id':0, 'name': 1, 'founded_day':1}
df=pd.DataFrame(colec.find(query,filtro).sort('acquisition.price_amount', -1).limit(10))
df

                name  founded_day
0           Netscape            4
1             PayPal            1
2             Zappos            1
3            Alibaba            1
4            Postini            2
5             Danger            1
6  Clearwell Systems            6
7         PrimeSense            1
8             Amobee            1
9        BlueLithium            1

### 16. All the companies on the 'web' `category` that have more than 4000 employees. Sort them by the amount of employees in ascending order.

In [23]:
# Your Code
query={'$and': [{'category_code':'web'},
                {'number_of_employees': {'$gt': 4000}}]}
filtro = {'_id':0, 'name': 1, 'category_code':1, 'number_of_employees':1}

df=pd.DataFrame(colec.find(query,filtro).sort('number_of_employees', 1))
df

                            name category_code  number_of_employees
0                        Expedia           web                 4400
1                            AOL           web                 8000
2                        Webkinz           web                 8657
3                        Rakuten           web                10000
4  Los Angeles Times Media Group           web                10000
5                        Groupon           web                10000
6                         Yahoo!           web                13600
7                           eBay           web                15000
8                       Experian           web                15500

### 17. All the companies whose acquisition amount is more than 10.000.000, and currency is 'EUR'.

In [24]:
# Your Code
query={'$and': [{'acquisition.price_currency_code':'EUR'},
                {'acquisition.price_amount': {'$gt': 10_000_000}}]}
filtro = {'_id':0, 'name': 1, 'acquisition.price_currency_code':1,'acquisition.price_amount':1}
df=pd.DataFrame(colec.find(query,filtro))
df

                  name                                        acquisition
0                  ZYB  {'price_amount': 31500000, 'price_currency_cod...
1              Apertio  {'price_amount': 140000000, 'price_currency_co...
2    Greenfield Online  {'price_amount': 40000000, 'price_currency_cod...
3              Webedia  {'price_amount': 70000000, 'price_currency_cod...
4            Wayfinder  {'price_amount': 24000000, 'price_currency_cod...
5  Tuenti Technologies  {'price_amount': 70000000, 'price_currency_cod...
6       BioMed Central  {'price_amount': 43400000, 'price_currency_cod...

### 18. All the companies that have been acquired on the first trimester of the year. Limit the search to 10 companies, and retrieve only their `name` and `acquisition` fields.

In [25]:
# Your Code
query ={'acquisition.acquired_month':{'$lt': 4}}
filtro = {'_id':0, 'name': 1, 'acquisition.acquired_month':1}
df=pd.DataFrame(colec.find(query,filtro).limit(10))
df

          name            acquisition
0         Kyte  {'acquired_month': 1}
1   NetRatings  {'acquired_month': 2}
2       blogTV  {'acquired_month': 3}
3   Livestream  {'acquired_month': 1}
4     iContact  {'acquired_month': 2}
5      Coghead  {'acquired_month': 2}
6  Dailymotion  {'acquired_month': 2}
7     Netvibes  {'acquired_month': 2}
8       Flickr  {'acquired_month': 3}
9   BabyCenter  {'acquired_month': 3}

# Bonus
### 19. All the companies that have been founded between 2000 and 2010, but have not been acquired before 2011.

In [26]:
# Your Code
query={'$and': [{'founded_year': {'$gte': 2000, '$lte': 2010}}, 
                {'acquisition.acquired_year': {'$gte': 2011}}]}
filtro = {'_id':0, 'name': 1,'founded_year':1,'acquisition.acquired_year':1}   
df=pd.DataFrame(colec.find(query,filtro))
df.head()

              name  founded_year              acquisition
0         Wetpaint          2005  {'acquired_year': 2013}
1             Digg          2004  {'acquired_year': 2012}
2             Geni          2006  {'acquired_year': 2012}
3             Kyte          2006  {'acquired_year': 2011}
4  Jingle Networks          2005  {'acquired_year': 2011}

### 20. All the companies that have been 'deadpooled' after the third year.

In [27]:
# Your Code
query ={'$and': [{'$expr': {'$gt':['$deadpooled_year',{'$add':['$founded_year',3]}]}}, 
                                    {'founded_year':{'$ne':None}},{'deadpooled_year':{'$ne':None, '$gte':1800}}]}

#query = {'deadpooled_year': {'$gt':{'$inc':{'founded_year',3]}}}
filtro = {'_id':0, 'name': 1,'founded_year':1,'deadpooled_year':1} 
df=pd.DataFrame(colec.find(query,filtro))
df

                 name  founded_year  deadpooled_year
0            Babelgum          2007             2013
1               Thoof          2006             2013
2              Wesabe          2005             2010
3             Stickam          2006             2013
4            AllPeers          2004             2008
..                ...           ...              ...
432         SpeakSoft          2007             2012
433            Tagito          2008             2012
434  Nordic Windpower          2007             2013
435    Nethra Imaging          2003             2012
436           Prolify          2002             2007

[437 rows x 3 columns]